FutureDesigns/uEZ/uEZ/Source/Devices/Flash/NXP/LPC2478/LPC2478_IAP.c
    // Let's do it
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    // Write the given block of data to the given address
    // Cut up the write command into blocks of BLOCK_SIZE size.
    // Keep doing this until all the bytes are processed
    while (aNumBytes) {
        error = IIAPWrite(&aOffset, &aBuffer, &aNumBytes);
        if (error != UEZ_ERROR_NONE)
            break;
    }

    UEZSemaphoreRelease(p->iSem);

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC2478_BlockErase
 *---------------------------------------------------------------------------*
 * Description:
 *      Erase one or more blocks in the given location
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt32 aOffset             -- Byte offset into the flash memory
 *      TUInt32 aNumBytes           -- Number of bytes
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC2478_BlockErase(
    void *aWorkspace,
    TUInt32 aOffset,
    TUInt32 aNumBytes)
{
    T_Flash_NXP_LPC2478_Workspace *p =
        (T_Flash_NXP_LPC2478_Workspace *)aWorkspace;
    TInt32 blockNum;
    TInt32 blockEnd;

    T_uezError error = UEZ_ERROR_NONE;

    // No bytes?  Do nothing
    if (aNumBytes == 0)
        return UEZ_ERROR_NONE;

    // Find the block
    blockNum = IIAPAddressToSectorNumber(aOffset);
    if (blockNum == -1)
        return UEZ_ERROR_NOT_FOUND;
    blockEnd = IIAPAddressToSectorNumber(aOffset+aNumBytes-1);
    if (blockEnd == -1)
        return UEZ_ERROR_NOT_FOUND;

    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    // Erase that block
    while (blockNum <= blockEnd) {
        error = IIAPEraseIfNotErased(blockNum++);
        if (error)
            break;
    }

    // Done erasing, resume normal control
    UEZSemaphoreRelease(p->iSem);

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC2478_ChipErase
 *---------------------------------------------------------------------------*
 * Description:
 *      Erase the complete chip
 * Inputs:
 *      void *aW                    -- Workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC2478_ChipErase(void *aWorkspace)
{
    T_Flash_NXP_LPC2478_Workspace *p =
        (T_Flash_NXP_LPC2478_Workspace *)aWorkspace;
    T_uezError error;
    TUInt32 sector;

    // Prepare the sector for erase
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);
#if LPC2478_IAP_PROTECT_FIRST_64K
    sector=16; // Skip the first 64K
#else
    sector=0;
#endif      
    for (; sector<30; sector++) {
        error = IIAPPrepareSector(sector);
        if (error)
            break;

        // Start sector
        G_parameters[1] = sector;
        // End sector
        G_parameters[2] = sector;
        // Clock frequency in kHz
        G_parameters[3] = PRG_FREQUENCY / 1000;

        if (IIAPCmd(IAP_CMD_ERASE_SECTOR) != CMD_SUCCESS) {
            error = UEZ_ERROR_COULD_NOT_ERASE;
            break;
        }

        // Mark sector as erased
        G_sectorsNeedingErase[sector] = EFalse;
        break;
    }
    UEZSemaphoreRelease(p->iSem);

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC2478_QueryReg
 *---------------------------------------------------------------------------*
 * Description:
 *      Query the chip for the given register (word based address).
 * Inputs:
 *      void *aWorkspace            -- Workspace
 *      TUInt32 aReg                -- Register to query
 *      TUInt32 *aValue             -- Place to store value returned
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC2478_QueryReg(
    void *aWorkspace,
    TUInt32 aReg,
    TUInt32 *aValue)
{
    T_uezError error = UEZ_ERROR_NONE;
    PARAM_NOT_USED(aWorkspace);
    PARAM_NOT_USED(aReg);

    // Do nothing
    *aValue = 0;

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC2478_GetChipInfo
 *---------------------------------------------------------------------------*
 * Description:
 *      Get information about the chip size
 * Inputs:
 *      void *aW                    -- Workspace
 *      T_FlashChipInfo *aInfo      -- Pointer to structure to receive info
 * Outputs:
 *      T_uezError                   -- Error code.  Returns UEZ_ERROR_NOT_FOUND
 *                                      if flash information is not found
 *                                      (in this case, missing QRY header)
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC2478_GetChipInfo(
    void *aWorkspace,
    T_FlashChipInfo *aInfo)
{
    PARAM_NOT_USED(aWorkspace);

    // Manually fill in the structure with a list
    // of 16x 4K blocks followed by 14x 16K blocks
    aInfo->iBitWidth = 8;
    aInfo->iNumBytesHigh = 0;
    aInfo->iNumBytesLow = 512*1024;
    aInfo->iNumRegions = 2;
    aInfo->iRegions[0].iNumEraseBlocks = 16;
    aInfo->iRegions[0].iSizeEraseBlock = 4*1024;
    aInfo->iRegions[1].iNumEraseBlocks = 14;
    aInfo->iRegions[1].iSizeEraseBlock = 32*1024;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  Flash_NXP_LPC2478_GetBlockInfo
 *---------------------------------------------------------------------------*
 * Description:
 *      Get information about the block
 * Inputs:
 *      void *aW                    -- Workspace
 *      TUInt32 aOffset             -- Byte offset into flash
 *      T_FlashChipInfo *aInfo      -- Pointer to structure to receive info
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError Flash_NXP_LPC2478_GetBlockInfo(
    void *aWorkspace,
    TUInt32 aOffset,
    T_FlashBlockInfo *aBlockInfo)
{
    if (aOffset < 0x10000) {
        // 4K blocks
        aBlockInfo->iOffset = aOffset & 0xFFFFF000;
        aBlockInfo->iSize = 0x1000;
    } else {
        // 32K blocks
        aBlockInfo->iOffset = aOffset & 0xFFFF8000;
        aBlockInfo->iSize = 0x8000;
    }

    return UEZ_ERROR_NONE;
}

void Flash_NXP_LPC2478_Create(const char *aName)
{
    UEZDeviceTableRegister(aName,
        (T_uezDeviceInterface *)&Flash_NXP_LPC2478_Interface, 0, 0);
}

/*---------------------------------------------------------------------------*
 * Device Interface table:
 *---------------------------------------------------------------------------*/
const DEVICE_Flash Flash_NXP_LPC2478_Interface = { {
// Common device interface
    "Flash:NXP:LPC2478:16Bit",
    0x0100, //<<---- What is the 0x100 stand for??
    Flash_NXP_LPC2478_InitializeWorkspace,
    sizeof(T_Flash_NXP_LPC2478_Workspace), },

// Functions
    Flash_NXP_LPC2478_Open,
    Flash_NXP_LPC2478_Close,
    Flash_NXP_LPC2478_Read,
    Flash_NXP_LPC2478_Write,
    Flash_NXP_LPC2478_BlockErase,
    Flash_NXP_LPC2478_ChipErase,
    Flash_NXP_LPC2478_QueryReg,
    Flash_NXP_LPC2478_GetChipInfo,
    Flash_NXP_LPC2478_GetBlockInfo, };

/*-------------------------------------------------------------------------*
 * End of File:  LPC2478_IAP.c
 *-------------------------------------------------------------------------*/
